Revit 2024 API
MechanicalEquipmentSet.OnStandby Property
 The number of pieces of mechanical equipment that are not operational at any given time.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public int OnStandby { get; set; }
Visual Basic
Public Property OnStandby As Integer
	Get
	Set
Visual C++
public:
property int OnStandby {
	int get ();
	void set (int value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: There should be at least one equipment on duty.
See Also
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace